#include "privacydialog.h"

#include <QDebug>
#include <QVBoxLayout>
#include <QHBoxLayout>

PrivacyDialog::PrivacyDialog(QWidget *parent) :
    QDialog(parent)
{
    this->setWindowFlags(Qt::Dialog);
    setWindowTitle(tr("Set"));
    initUi();
}
PrivacyDialog::~PrivacyDialog()
{

}

void PrivacyDialog::initUi()
{
    this->resize(560 , 560);
    QVBoxLayout *mverticalLayout = new QVBoxLayout(this);
    mverticalLayout->setSpacing(8);
    mverticalLayout->setContentsMargins(24, 0, 24, 24);

    QLabel *mTitleLabel = new QLabel(QString("银河麒麟最终用户使用许可协议和隐私政策声明") , this);
    mTitleLabel->setAlignment(Qt::AlignCenter);
    mverticalLayout->addWidget(mTitleLabel);
    QTextBrowser *mContentLabel = new QTextBrowser(this);
     mContentLabel->setText("尊敬的银河麒麟操作系统及相关产品用户:\n\n   "
                            "请您仔细阅读本协议条款、补充许可条款（统称“协议”）及银河麒麟操作系统隐私政策声明（以下简称“声明”）。"
                            "当您确认了解并点击下一步时，即表明您已接受本协议的条款，本协议将立即生效，对您和本公司双方具有法律约束力。\n   "
                            "本协议及声明中的“本产品”是指由麒麟软件有限公司开发并制作发行的用于办公或构建企业及政府的信息化基础设施——“银"
                            "河麒麟操作系统软件产品”。“我们”是指麒麟软件有限公司。“您”是指支付授权费用并使用银河麒麟操作系统及相关产品的用户。\n\n"
                            "银河麒麟最终用户使用许可协议\n版本发布日期：【2021】年【7】月【30】日\n版本生效日期：【2021】年【7】月【30】日\n\n"
                            "本协议将向您说明以下内容：\n一、使用许可\n二、Java技术限制\n三、Cookie和其他技术\n知识产权条款\n五、开放源代码说明\n"
                            "六、第三方软件/服务说明\n七、免责条款\n八、协议完整性及可分割性说明\n九、适用法律及争议解决\n\n   一、使用许可\n\n   "
                            "按照已经为本产品支付费用的用户数目及计算机硬件类型，我们向您授予非排他、不可转让的许可，仅允许被授权人单位及与其签订"
                            "劳动合同的员工使用由麒麟软件提供的随附软件和文档以及任何错误纠正。\n   1.教育机构使用许可\n   在遵守本协议的条款和条件的情况下，"
                            "如果您是教育机构，允许贵机构仅在内部使用随附的未经修改的二进制格式的软件。此处的“在内部使用”是指被授权人单位及与其签订劳动"
                            "合同的员工以及在贵机构入学的学生使用本产品。 \n   2.字型软件使用\n   本产品中预装的和生成字体样式的软件（“字型软件”）。您不可从"
                            "软件中分离字型软件，不可改动字型软件，以新增此等字型软件被作为本产品的一部分交付予您时所不具备的任何功能，不可将字型软件嵌"
                            "入作为商业产品提供以换取收费或其他报酬的文件、不可脱离安装了本产品的机器使用。如将字型软件用于对外宣传等其他商业用途时，"
                            "请您与字体版权厂商联系协商以获得对您相关行为的许可。\n\n   二、Java技术限制\n\n   您不可更改“Java平台界面”（简称“JPI”，即指明为"
                            "“java”包或“java”包的任何子包中的类），无论通过在JPI中创建额外的类，还是通过其他方式导致对JPI中的类进行增添或更动，均为不可。"
                            "如果您创建一个额外的类以及一个或多个相关的API，而它们（i）扩展Java平台的功能；并且（ii）可供第三方软件开发者用于开发可调用"
                            "上述额外API的额外软件，则您必须迅即广泛公布对此种API的准确说明，以供所有开发者免费使用。您不可创建、或授权其他被许可人创建"
                            "以任何方式标示为“java”、“javax”、“sun”的额外的类、界面、子包或Sun在任何命名约定中指明的类似约定。参见Java运行时环境二进制代"
                            "码许可的适当版本（目前位于http://jdk.java.net），以了解可与Java小程序和应用程序共同分发的运行时代码的可供情况。\n\n   三、Cookie和其他技术\n\n   "
                            "为帮助我们更好地了解并服务用户，我们的网站、在线服务和应用程序可能会使用“Cookie”技术。这些Cookie用于存储进出系统的网络流量以及因检测错误"
                            "而生成的流量，因此必须设置。 我们通过使用这些Cookie来了解您与我们的网站和在线服务如何进行交互。\n   如果您想禁用 Cookie 并且使用的是Firefox浏"
                            "览器，可在Firefox的隐私与安全中心进行设置。如果您使用的是其他浏览器，请向相关供应商咨询具体方案。 \n   依照《中华人民共和国网络安全法》第七十"
                            "六条第五款，个人信息，是指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息，包括但不限于自然人的姓名、出生日"
                            "期、身份证件号码、个人生物识别信息、住址、电话号码等。如果Cookie中包含上述信息，或者存在通过Cookie收集的非个人信息与其他个人信息合并后的信"
                            "息，出于本隐私政策的目的，我们会将合并后的信息视为个人隐私信息，将参照银河麒麟隐私政策声明，为您的个人信息提供相应的安全保护措施。\n\n   "
                            "四、知识产权条款\n\n   1.商标和标识\n   本产品受到版权（著作权）法、商标法和其他法律及国际知识产权公约的保护。我们或其许可方保留对本产品的所有权"
                            "及所有相关的知识产权。对于我们或其许可方的任何商标、服务标记、标识或商号的任何权利、所有权或利益，本协议均不作任何授权。您对麒麟软件标记的任"
                            "何使用都应有利于麒麟软件，未经我们书面同意，不得擅自使用麒麟软件任何商标、标识。\n   2.关于复制、修改及分发\n   如果在所有复制品中维持本协议书不"
                            "变，您可以且必须根据《GNU GPL-GNU通用公共许可证》复制、修改及分发银河麒麟操作系统软件产品中遵守《GNU GPL-GNU通用公共许可证》协议的软件，"
                            "其他不遵守《GNU GPL-GNU通用公共许可证》协议的银河麒麟操作系统软件产品必须根据相关法律、其他许可协议进行复制、修改及分发，但任何以银河麒麟"
                            "操作系统软件产品为基础的衍生发行版未经我们的书面授权不能使用任何我们的商标或其他任何标志。\n   特别注意：该复制、修改及分发不包括本产品中包含"
                            "的任何不适用《GNU GPL-GNU通用公共许可证》的软件，如银河麒麟操作系统软件产品中包含的软件商店、输入法软件、字库软件、第三方应用软件等。除非"
                            "适用法律予以禁止，否则您不得对上述软件进行复制、修改（包括反编译或反向工程）、分发。 \n\n   五、开放源代码说明\n\n   对于本产品中包含的任何开放"
                            "源代码，本协议的任何条款均不得限制、约束或以其它方式影响任何适用开放源代码许可证赋予您的任何相应的权利或者义务或您应遵守的各种条件。\n\n   六、"
                            "第三方软件/服务说明\n\n   本协议所指的第三方软件/服务是指由非银河麒麟操作系统生产商的其他组织或个人开发的相关软件/服务。本产品可能包含或捆绑有"
                            "第三方软件/服务，这些第三方软件/服务附带单独的许可协议，您使用附带单独许可协议的任何第三方软件/服务需受到该单独许可协议的约束。\n   我们不对本"
                            "产品中的第三方软件/服务拥有任何控制权，也不对其提供方或用户行为的合法性、准确性、有效性、安全性进行任何明示或默示的保证或担保。\n\n   七、免责条款"
                            "\n\n   1.有限担保\n    我们向您担保，自购买或其他合法取得本产品之日起九十（90）天内（以销售合同日期为准），本产品的存储介质（如果有）在正常使用的情况"
                            "下无材料和工艺方面的缺陷。在本有限担保项下，您可获得的所有补偿及我们的全部责任为由我们选择更换本产品介质或退还本产品的购买费用。\n   2.免责声明\n   "
                            " 除上述有限担保外，本软件按“原样”提供，不提供任何明示或默示的条件、陈述及担保，包括对适销性、对特定用途的适用性或非侵权性的任何默示的担保，均不予"
                            "负责，但本免责声明被认定为法律上无效的情况除外。\n   3.责任限制\n   在法律允许范围内，无论在何种情况下，无论采用何种有关责任的理论，无论因何种方式导"
                            "致，对于因使用或无法使用本软件引起的或与之相关的任何收益损失、利润或数据损失，或者对于特殊的、间接的、后果性的、偶发的或惩罚性的损害赔偿，我们或"
                            "其许可方均不承担任何责任（即使我们已被告知可能出现上述损害赔偿）。根据本协议，在任何情况下，无论是在合同、侵权行为（包括过失）方面，还是在其他方"
                            "面，我们对您的责任将不超过您就本软件所支付的金额。即使上述担保未能达到其基本目的，上述限制仍然适用。\n\n   八、协议完整性及可分割性说明\n\n   "
                            "1.协议完整性\n   本协议是我们就产品使用与您达成的完整协议。它取代此前或同期的所有和本协议不一致的口头或书面往来信息、建议、陈述和担保。在本协议期间，"
                            "有关报价、订单、回执或各方之间就本协议内容进行的其他往来通信中的任何冲突条款或附加条款，均以本协议为准。对本协议的任何修改均无约束力，除非通过书面"
                            "进行修改并由每一方的授权代表签字。\n   2.可分割性\n   如果本协议中有任何规定被认定为无法执行，则删除相应规定，本协议仍然有效，除非该删除会防碍各方根本"
                            "目的的实现（在这种情况下，本协议将立即终止）。\n\n   九、适用法律及争议解决\n\n   1.管辖法律适用\n   与本协议相关的任何争议解决（包括但不限于诉讼、仲裁等）"
                            "均受适用中华人民共和国法律管辖。选择其它任何国家和地区的法律规则不予适用。\n   2.终止\n   如果本软件成为或在任一方看来可能成为任何知识产权侵权索赔之标的，"
                            "则任一方可立即终止本协议。\n   本协议在终止之前有效。您可以随时终止本协议，但必须同时销毁本软件的全部正本和副本。如果您未遵守本协议的任何规定，则本协议将"
                            "不经我们发出通知立即终止。终止时，您必须销毁本软件的全部正本和副本，并且需承担因未遵守本协议而导致的法律责任。\n\n   以上，本协议提供中英文两种版本，以上"
                            "任何内容如有歧义，以中文版本为准。\n\n银河麒麟操作系统隐私政策声明\n版本发布日期：【2021】年【7】月【30】日\n版本生效日期：【2021】年【7】月【30】日\n\n"
                            "   我们非常重视个人信息和隐私保护，为了保证合法、合理、适度的收集、存储、使用您的个人隐私信息，并在安全、可控的情况下进行传输、存储，我们制定了本声明。我们"
                            "将会按照法律要求和业界成熟安全标准，为您的个人信息提供相应的安全保护措施。\n   本声明将向您说明以下内容：\n   一、关于收集和使用您的个人信息\n   二、如何存储和保护"
                            "您的个人信息\n   三、如何管理您的个人信息\n   四、关于第三方软件/服务的隐私说明\n   五、关于未成年人使用产品\n   六、本声明如何更新\n   七、如何联系我们\n\n"
                            "一、如何收集和使用您的个人信息\n\n   1.收集个人信息的情况\n   我们在您使用本产品过程中收集相关的信息，主要为了向您提供更高质量、更易用的产品和更好的服务。收集的"
                            "部分信息由您直接提供，其他信息则由我们通过您与产品的交互以及对产品的使用和体验收集而来。除非我们已根据适用的法律规定取得您的明示同意，我们不会主动收集并处理您"
                            "的个人信息。\n   1）本产品授权许可机制，会根据您所使用计算机的网卡、固件和主板等信息通过加密机制和转换方法生成申请产品正式授权许可的机器码；您将该机器码发送给麒"
                            "麟软件商务人员后，可根据合同及相关协议申请正式许可。该机器码不直接包含您所使用计算机的网卡、固件和主板等设备的具体信息。\n   2）本产品软件商店的服务器端，会根据"
                            "您所使用计算机的CPU类型信息以及IP地址进行连接，同时我们会收集您使用本产品软件商店的相关信息，包括但不限于打开软件商店的时间、各页面之间的交互、搜索内容、下载"
                            "的内容等，收集的相关信息一般记录在软件商店的服务端系统的日志中，具体存储位置可能因为不同的服务场景有所变动。\n   3）本产品的升级更新，会根据您所使用计算机的IP地"
                            "址进行连接，以便实现您升级更新系统。\n   4）因业务往来及技术服务等向您收集电子邮箱、电话、姓名等个人信息。\n   5）本产品的生物特征管理工具支持系统组件使用生物特征"
                            "进行认证，包括指纹、指静脉、虹膜、声纹等。您录入的生物特征信息将储存在本地计算机，这部分信息我们仅接收验证结果，不会收集和上传。如您不需要使用生物特征进行系统认"
                            "证，可以在生物特征管理工具中关闭该功能。\n   6）本产品提供录音功能，您在使用本产品录音软件中，我们仅会将您使用录音时的音频内容存储在本地计算机中，不会进行收集和上传。"
                            "\n   7）本产品的服务与支持功能会收集由您提供给我们的日志、电子邮箱、电话、姓名等信息，便于提供技术服务，我们将妥善保管您的个人信息。\n   8）本产品升级过程中，如需新增"
                            "收集您的个人信息，我们将及时更新本部分内容。\n\n   2.使用个人信息的情况\n   我们严格遵守法律法规的规定及与您的约定，将收集的信息用于以下用途。若我们超出以下用途，我们将"
                            "再次向您进行说明，并征得您的同意。\n   1）涉及产品许可机制、软件商店使用、系统更新维护、生物识别、在线服务等需要；\n   2）我们会利用相关信息协助提升产品的安全性、可靠性"
                            "和可持续服务；\n   3）我们会利用收集的信息（例如您提供的电子邮件地址、电话等）直接与您沟通。例如，业务联系、技术支持或服务回访；\n   4）我们会利用收集的数据改进产品当前"
                            "的易用性、提升产品用户体验（例如软件商店的个性化推荐）以及修复产品缺陷等；\n   5）我们会将所收集到的用户行为数据用于大数据分析。例如，我们将收集到的信息用于分析形成不"
                            "包含任何个人信息的城市热力图或行业洞察报告。我们可能对外公开并与我们的合作伙伴分享经统计加工后不含身份识别内容的信息，用于了解用户如何使用我们服务或让公众了解我们服"
                            "务的总体使用趋势。\n   6）我们可能使用您的相关信息，在相关网站、应用及其他渠道向您提供与您更加相关的广告。\n   7）为了遵从相关法律法规、部门规章、政府指令的相关要求。\n\n   "
                            "3.信息的分享及对外提供\n   我们不会共享或转让您的个人信息至第三方，但以下情况除外：\n   1）获取您的明确同意后，我们会与第三方分享您的个人信息；\n   2）为实现外部处理的目的，"
                            "我们可能与关联公司或其他第三方合作伙伴（第三方服务供应商、承包商、代理、应用开发者等）分享您的个人信息。我们将采用加密、匿名化处理等手段来保障您的信息安全；\n    3）我们"
                            "不会对外公开披露所收集的个人信息，如必须公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的同意；\n   4）随着我们业务的持续发展，"
                            "我们有可能进行合并、收购、资产转让等交易，我们将告知相关情形，按照法律法规及不低于本声明所要求的标准继续保护或要求新的控制者继续保护您的个人信息；\n    5）如我们使用您的个"
                            "人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用您的个人信息前，再次向您告知并征得您的同意。\n\n   4.征得授权同意的例外情况\n   1）与国家安全、国防"
                            "安全等国家利益直接相关的；\n   2）与公共安全、公共卫生、公众知情等重大公共利益直接相关的；\n   3）与犯罪侦查、起诉、审判和判决执行等直接相关的；\n   4）出于维护您或其他"
                            "个人的生命、财产等重大合法权益但又无法得到您本人同意的；\n   5）所收集的个人信息是您自行向社会公众公开的；\n   6）从合法公开披露的信息中收集的个人信息，如合法的新闻报"
                            "道、政府信息公开等渠道；\n   7）根据您要求签订和履行合同所必需的；\n   8）用于维护所提供的产品或服务的安全稳定运行所必需的。如发现、处置产品或服务的故障；\n   9）出于公"
                            "共利益开展统计或学术研究所必需，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；\n   10）法律法规规定的其他情形。\n\n二、我们如何存储"
                            "和保护您的个人信息\n\n   1.信息存储的地点\n   我们会按照法律法规规定，将在中国境内收集和产生的个人信息存储于中国境内。\n   2.信息存储的期限\n   一般而言，我们仅为实现目的所"
                            "必需的时间或法律法规规定最短期限保留您的个人信息。记录在日志中的信息会按配置在一定期限保存及自动删除。\n   当我们的产品或服务发生停止运营的情形时，我们将以通知、公告"
                            "等形式通知您，在合理的期限内删除您的个人信息或进行匿名化处理，并立即停止收集个人信息的活动。\n   3.我们如何保护这些信息\n   我们努力为用户的信息安全提供保障，以防止信息"
                            "的丢失、不当使用、未经授权访问或披露。\n   我们将在合理的安全水平内使用安全保护措施以保障信息的安全。例如，我们会使用加密技术等手段来保护您的系统级账户密码。\n   我们建"
                            "立专门的管理制度、流程和组织以保障信息的安全。例如，我们严格限制访问信息的人员范围，要求他们遵守保密义务。\n   4.应急预案\n    若发生个人信息泄露等安全事件，我们会依法启动"
                            "应急预案，阻止安全事件扩大，并以推送通知、公告等形式告知您安全事件的情况、事件可能对您的影响以及我们将采取的补救措施。我们还将按照法律法规和监管部门要求，上报个人信息"
                            "安全事件的处置情况。\n\n三、如何管理您的个人信息\n\n   如果担心因使用本产品导致个人信息的泄露，您可根据个人及业务需要考虑暂停或不使用涉及个人信息的相关功能，如产品正式授"
                            "权许可、应用商店、系统更新升级、生物识别等。\n   在使用本产品之上的第三方软件/服务时，请注意个人隐私保护。\n\n四、关于第三方软件/服务的隐私说明\n\n   "
                            "本协议所指的第三方软件/服务是由非银河麒麟操作系统生产商的其他组织或个人开发的相关软件/服务。\n   您在本产品之上安装或使用第三方软件/服务时，第三方"
                            "软件/服务的隐私保护和法律责任由第三方软件/服务自行负责，请您仔细阅读和审查第三方软件/服务对应的隐私声明或条款，注意个人隐私保护。\n\n五、关于未成"
                            "年人使用产品\n\n   如果您是未成年人，则需要您的监护人同意您使用本产品并同意相关服务条款。 除了提供产品所需要的信息外，我们不会刻意要求未成年人提供"
                            "其他更多数据。征得家长同意或授权后，未成年人所创建的帐户即被视为等同于其他任何帐户。父母和监护人也应采取适当的预防措施保护未成年人，监督其对本产"
                            "品的使用。\n\n六、本声明如何更新\n\n   我们可能会随时更新本声明，并且会在变更时通过产品安装过程或公司网站向您展示变更后的声明。在这些变更生效后使"
                            "用服务或根据这些条款授予许可的任何软件，即表示您同意新的条款。如果您不同意新的条款，则必须停止使用本产品，请关闭您在本产品之上创建的帐户；如果您"
                            "是家长或监护人，请帮助您的未成年子女关闭他或她在本产品之上创建的帐户。\n\n七、如何联系我们\n\n   如您对本声明存在任何疑问，或任何相关的投诉、意见"
                            "，可通过我们的客服热线400-089-1870、官方网站（www.kylinos.cn）或本产品中“服务与支持”应用进行咨询或反映。您也可以通过发送邮件至market@kylinos.cn与"
                            "我们联系。\n   受理您的问题后，我们会及时、妥善处理。一般情况下，我们将在15个工作日内给予答复。\n   本声明自更新之日起生效，同时提供中英文两种版本，"
                            "以上任何条款如有歧义，以中文版本为准。\n   最近更新日期：2021年10月25日\n\n"
                            "地址：天津市滨海高新区塘沽海洋科技园信安创业广场3号楼（300450）\n             北京市海淀区北四环西路9号银谷大厦（100190）\n             长沙市开福区芙蓉中路1段303号富兴"
                            "世界金融中心T3栋（410000）\n             上海市徐汇区番禺路1028号数"
                            "娱大厦（200030）\n电话：天津（022）58955650  北京（010）51659955\n             "
                            "长沙（0731）88280170 上海（021）51098866\n传真：天津（022）58955651  北京（010）62800607 \n             长沙（0731）88280166 上海（021）51062866\n"
                            "\n公司网站：www.kylinos.cn\n电子邮件：support@kylinos.cn");
    mverticalLayout->addWidget(mContentLabel);
    QLabel *label_1 = new QLabel(QString("麒麟软件有限公司") , this);
    label_1->setAlignment(Qt::AlignRight);
    mverticalLayout->addWidget(label_1);
}








